# Ejercicio

Vamos a construir una BBDD en SQLite que modele, de forma muy estilizada, las necesidades de un administrador de cartera.

De forma muy sencilla un administrador tiene clientes, que tinene cuentas de inversión, a esas cuentas le hacen aportes y retiros de capital y con ese capital compran y venden activos financieros.

## Creación de la Base de Datos

In [152]:
import sqlite3

Si el archivo no existe, SQLite lo creará en la ruta especificada.

In [153]:
conn = sqlite3.connect('data/administrador.db')

Se crea el objeto `cursor`.

In [154]:
cursor = conn.cursor()

Para habilitar las llaves foráneas.

In [155]:
cursor.execute("PRAGMA foreign_keys = 1")

La siguiente función nos permitirá ver las tablas de la base de datos.

In [156]:
import pandas as pd

In [157]:
def show_tables(conn):
    qry_tables = "SELECT name, sql FROM sqlite_master WHERE type = 'table'"
    return pd.read_sql(qry_tables, conn)

¿Qué hay ahora en la BBDD?

In [158]:
show_tables(conn)

Empty DataFrame
Columns: [name, sql]
Index: []

Vemos que todavía no hay ninguna tabla.

## Tablas

La BBDD tendrá las siguientes tablas:

- clientes
- cuentas
- tipos de movimientos (compras, ventas, aportes, retiros)
- caja (cantidad de efectivo disponible en una cuenta)
- tipos de inversión (supondremos para simplificar que sólo se invierte en cuotas de fondos y acciones)
- inversiones (de una cuenta)
- precios de mercado (de las cuotas de fondos)

### Tabla `clientes`

Notar las restricciones de tipo `UNIQUE` en los campos `email` y `telefono`. Estas restricciones indican que estos campos deben ser únicos para cada registro, es decir, dos o más clientes **NO** pueden tener el mismo email o teléfono.

In [159]:
qry = "CREATE TABLE IF NOT EXISTS clientes ( \
id INTEGER PRIMARY KEY AUTOINCREMENT, \
nombre TEXT NOT NULL, \
apellido TEXT NOT NULL, \
email TEXT NOT NULL UNIQUE, \
telefono TEXT NOT NULL UNIQUE \
)"

In [160]:
cursor.execute(qry)

Verifiquemos el resultado.

In [161]:
show_tables(conn)

              name                                                sql
0         clientes  CREATE TABLE clientes ( id INTEGER PRIMARY KEY...
1  sqlite_sequence             CREATE TABLE sqlite_sequence(name,seq)

¿Y la tabla `sqlite_sequence`?

In [162]:
pd.read_sql("SELECT * FROM sqlite_sequence", conn)

Empty DataFrame
Columns: [name, seq]
Index: []

Con esta función vamos a ir viendo si la tabla cambia más adelante.

In [163]:
def ss():
    return pd.read_sql("SELECT * FROM sqlite_sequence", conn)

### Tabla `cuentas`

La tabla `cuentas` tendrá una llave foránea hacia la tabla `clientes`. Este campo permite establecer de qué cliente es la cuenta.

In [164]:
qry = "CREATE TABLE IF NOT EXISTS cuentas ( \
id INTEGER PRIMARY KEY AUTOINCREMENT, \
nombre TEXT NOT NULL, \
id_cliente INTEGER, \
FOREIGN KEY (id_cliente) REFERENCES clientes (id) \
ON DELETE NO ACTION ON UPDATE NO ACTION \
)"

In [165]:
cursor.execute(qry)

In [166]:
show_tables(conn)

              name                                                sql
0         clientes  CREATE TABLE clientes ( id INTEGER PRIMARY KEY...
1  sqlite_sequence             CREATE TABLE sqlite_sequence(name,seq)
2          cuentas  CREATE TABLE cuentas ( id INTEGER PRIMARY KEY ...

In [167]:
ss()

Empty DataFrame
Columns: [name, seq]
Index: []

### Tabla `tipo_movimiento`

Esta tabla registra los tipos de movimientos válidos de caja. Éstos serán `APORTE`, `RETIRO`, `COMPRA` y `VENTA`.

In [168]:
qry = "CREATE TABLE IF NOT EXISTS tipo_movimiento ( \
id INTEGER PRIMARY KEY AUTOINCREMENT, \
codigo TEXT NOT NULL UNIQUE \
)"

In [169]:
cursor.execute(qry)

In [170]:
show_tables(conn)

              name                                                sql
0         clientes  CREATE TABLE clientes ( id INTEGER PRIMARY KEY...
1  sqlite_sequence             CREATE TABLE sqlite_sequence(name,seq)
2          cuentas  CREATE TABLE cuentas ( id INTEGER PRIMARY KEY ...
3  tipo_movimiento  CREATE TABLE tipo_movimiento ( id INTEGER PRIM...

In [171]:
ss()

Empty DataFrame
Columns: [name, seq]
Index: []

### Tabla `caja`

En esta tabla se registrarán los movimientos de caja de las cuentas.

In [172]:
qry = "CREATE TABLE IF NOT EXISTS caja ( \
id INTEGER PRIMARY KEY AUTOINCREMENT, \
id_cuenta INTEGER, \
codigo_movimiento TEXT NOT NULL, \
monto NUMERIC NOT NULL, \
FOREIGN KEY (id_cuenta) REFERENCES cuentas (id) \
ON DELETE NO ACTION ON UPDATE NO ACTION, \
FOREIGN KEY (codigo_movimiento) REFERENCES tipo_movimiento (codigo) \
ON DELETE NO ACTION ON UPDATE NO ACTION \
)"

In [173]:
cursor.execute(qry)

In [174]:
show_tables(conn)

              name                                                sql
0         clientes  CREATE TABLE clientes ( id INTEGER PRIMARY KEY...
1  sqlite_sequence             CREATE TABLE sqlite_sequence(name,seq)
2          cuentas  CREATE TABLE cuentas ( id INTEGER PRIMARY KEY ...
3  tipo_movimiento  CREATE TABLE tipo_movimiento ( id INTEGER PRIM...
4             caja  CREATE TABLE caja ( id INTEGER PRIMARY KEY AUT...

In [175]:
ss()

Empty DataFrame
Columns: [name, seq]
Index: []

### Tabla `tipos_instrumentos`

En esta tabla se registran los tipos de instrumentos en los que se puede invertir. Para este ejemplo, sólo utilizaremos activos *P x Q*, es decir `ACCIONES`, `ETF`, `CUOTAS_FONDOS`.

In [176]:
qry = "CREATE TABLE IF NOT EXISTS tipos_instrumentos ( \
id INTEGER PRIMARY KEY AUTOINCREMENT, \
codigo TEXT UNIQUE \
)"

In [177]:
cursor.execute(qry)

In [178]:
show_tables(conn)

                 name                                                sql
0            clientes  CREATE TABLE clientes ( id INTEGER PRIMARY KEY...
1     sqlite_sequence             CREATE TABLE sqlite_sequence(name,seq)
2             cuentas  CREATE TABLE cuentas ( id INTEGER PRIMARY KEY ...
3     tipo_movimiento  CREATE TABLE tipo_movimiento ( id INTEGER PRIM...
4                caja  CREATE TABLE caja ( id INTEGER PRIMARY KEY AUT...
5  tipos_instrumentos  CREATE TABLE tipos_instrumentos ( id INTEGER P...

In [179]:
ss()

Empty DataFrame
Columns: [name, seq]
Index: []

### Tabla `instrumentos`

Esta tabla requiere una llave foránea hacia la tabla `tipos_instrumentos`.

In [180]:
qry = "CREATE TABLE IF NOT EXISTS instrumentos ( \
id INTEGER PRIMARY KEY AUTOINCREMENT, \
codigo TEXT UNIQUE, \
codigo_instrumento TEXT NOT NULL, \
FOREIGN KEY (codigo_instrumento) REFERENCES tipos_instrumentos (codigo) \
ON DELETE NO ACTION ON UPDATE NO ACTION \
)"

In [181]:
cursor.execute(qry)

In [182]:
show_tables(conn)

                 name                                                sql
0            clientes  CREATE TABLE clientes ( id INTEGER PRIMARY KEY...
1     sqlite_sequence             CREATE TABLE sqlite_sequence(name,seq)
2             cuentas  CREATE TABLE cuentas ( id INTEGER PRIMARY KEY ...
3     tipo_movimiento  CREATE TABLE tipo_movimiento ( id INTEGER PRIM...
4                caja  CREATE TABLE caja ( id INTEGER PRIMARY KEY AUT...
5  tipos_instrumentos  CREATE TABLE tipos_instrumentos ( id INTEGER P...
6        instrumentos  CREATE TABLE instrumentos ( id INTEGER PRIMARY...

In [183]:
ss()

Empty DataFrame
Columns: [name, seq]
Index: []

### Tabla `inversiones`

In [184]:
qry = "CREATE TABLE IF NOT EXISTS inversiones ( \
id INTEGER PRIMARY KEY AUTOINCREMENT, \
id_cuenta INTEGER NOT NULL, \
codigo_instrumento TEXT NOT NULL, \
monto NUMERIC NOT NULL, \
precio NUMERIC NOT NULL, \
FOREIGN KEY (id_cuenta) REFERENCES cuentas (id) \
ON DELETE NO ACTION ON UPDATE NO ACTION, \
FOREIGN KEY (codigo_instrumento) REFERENCES instrumentos (codigo) \
ON DELETE NO ACTION ON UPDATE NO ACTION \
)"

In [185]:
cursor.execute(qry)

In [186]:
show_tables(conn)

                 name                                                sql
0            clientes  CREATE TABLE clientes ( id INTEGER PRIMARY KEY...
1     sqlite_sequence             CREATE TABLE sqlite_sequence(name,seq)
2             cuentas  CREATE TABLE cuentas ( id INTEGER PRIMARY KEY ...
3     tipo_movimiento  CREATE TABLE tipo_movimiento ( id INTEGER PRIM...
4                caja  CREATE TABLE caja ( id INTEGER PRIMARY KEY AUT...
5  tipos_instrumentos  CREATE TABLE tipos_instrumentos ( id INTEGER P...
6        instrumentos  CREATE TABLE instrumentos ( id INTEGER PRIMARY...
7         inversiones  CREATE TABLE inversiones ( id INTEGER PRIMARY ...

In [187]:
ss()

Empty DataFrame
Columns: [name, seq]
Index: []

### Tabla `precios_mercado`

Esta tabla registrará los precios de mercado de los instrumentos. En este caso definiremos una restricción de tipo `UNIQUE` a una combinación de campos.

In [188]:
qry = "CREATE TABLE IF NOT EXISTS precios_mercado ( \
id INTEGER PRIMARY KEY AUTOINCREMENT, \
fecha TEXT NOT NULL, \
id_instrumento INTEGER NOT NULL, \
precio NUMERIC NOT NULL, \
FOREIGN KEY (id_instrumento) REFERENCES instrumentos (id) \
ON DELETE NO ACTION ON UPDATE NO ACTION, \
UNIQUE(fecha, id_instrumento) \
)"

In [189]:
cursor.execute(qry)

In [190]:
show_tables(conn)

                 name                                                sql
0            clientes  CREATE TABLE clientes ( id INTEGER PRIMARY KEY...
1     sqlite_sequence             CREATE TABLE sqlite_sequence(name,seq)
2             cuentas  CREATE TABLE cuentas ( id INTEGER PRIMARY KEY ...
3     tipo_movimiento  CREATE TABLE tipo_movimiento ( id INTEGER PRIM...
4                caja  CREATE TABLE caja ( id INTEGER PRIMARY KEY AUT...
5  tipos_instrumentos  CREATE TABLE tipos_instrumentos ( id INTEGER P...
6        instrumentos  CREATE TABLE instrumentos ( id INTEGER PRIMARY...
7         inversiones  CREATE TABLE inversiones ( id INTEGER PRIMARY ...
8     precios_mercado  CREATE TABLE precios_mercado ( id INTEGER PRIM...

In [191]:
ss()

Empty DataFrame
Columns: [name, seq]
Index: []

## Insertar Data

Vamos a insertar data en las distintas tablas que hemos definido.

### Tabla `clientes`

Recordemos los campos de la tabla.

In [192]:
pd.read_sql("SELECT * FROM clientes", conn)

Empty DataFrame
Columns: [id, nombre, apellido, email, telefono]
Index: []

Para insertar data en una BBDD relacional se utiliza la instrucción `INSERT`. Notar que, dado que el campo `id` es `AUTOINCREMENT` no es necesario incluirlo.

In [193]:
qry = "INSERT INTO clientes (nombre, apellido, email, telefono) \
VALUES ('Alvaro', 'Diaz', 'alvaro@efaa.cl', 56955556666)"

In [194]:
cursor.execute(qry)

In [195]:
pd.read_sql("SELECT * FROM clientes", conn)

   id  nombre apellido           email     telefono
0   1  Alvaro     Diaz  alvaro@efaa.cl  56955556666

**HABLAR DEL COMMIT**

In [196]:
conn.commit()

Podemos también ingresar más de un registro a la vez.

In [197]:
qry = "INSERT INTO clientes (nombre, apellido, email, telefono) \
VALUES ('Ricardo', 'Gomez', 'ricardo.gomez@efaa.cl', 56955551234), \
('Thomas', 'Macmillan', 'thomas.macmillan@efaa.cl', 56955554321)"

In [198]:
cursor.execute(qry)
conn.commit()

In [199]:
pd.read_sql("SELECT * FROM clientes", conn)

   id   nombre   apellido                     email     telefono
0   1   Alvaro       Diaz            alvaro@efaa.cl  56955556666
1   2  Ricardo      Gomez     ricardo.gomez@efaa.cl  56955551234
2   3   Thomas  Macmillan  thomas.macmillan@efaa.cl  56955554321

Recordemos que el campo `email` tiene una restricción `UNIQUE`, veamos qué ocurre si, por error, ingresamos un email repetido.

In [200]:
qry = "INSERT INTO clientes (nombre, apellido, email, telefono) \
VALUES ('Oliver', 'Mohr', 'alvaro@efaa.cl', 56955553141)"

In [201]:
cursor.execute(qry)

IntegrityError: UNIQUE constraint failed: clientes.email

In [202]:
pd.read_sql("SELECT * FROM clientes", conn)

   id   nombre   apellido                     email     telefono
0   1   Alvaro       Diaz            alvaro@efaa.cl  56955556666
1   2  Ricardo      Gomez     ricardo.gomez@efaa.cl  56955551234
2   3   Thomas  Macmillan  thomas.macmillan@efaa.cl  56955554321

### Tabla `cuentas`

Recordemos los campos de esta tabla.

In [203]:
pd.read_sql("SELECT * FROM cuentas", conn)

Empty DataFrame
Columns: [id, nombre, id_cliente]
Index: []

Vamos a insertar algunas cuentas.

In [204]:
cuentas = [
    ('CUENTA1', 1),
    ('CUENTA2', 1),
    ('CUENTA1', 2),
    ('CUENTA1', 3)
]

Con este comando podemos insertar todas las cuentas con una sola instrucción.

In [205]:
cursor.executemany("INSERT INTO cuentas (nombre, id_cliente) VALUES (?, ?)", cuentas)
conn.commit()

In [206]:
pd.read_sql("SELECT * FROM cuentas", conn)

   id   nombre  id_cliente
0   1  CUENTA1           1
1   2  CUENTA2           1
2   3  CUENTA1           2
3   4  CUENTA1           3

¿Qué pasa si tratamos de insertar una cuenta para un cliente que no existe?

In [207]:
cursor.execute("INSERT INTO cuentas (nombre, id_cliente) VALUES ('CUENTA1', 4)")

IntegrityError: FOREIGN KEY constraint failed

### Tabla `tipo_movimiento`

Esta es una tabla con data estática. Vamos a insertar los 4 tipos de movimientos que indicamos al inicio.

In [208]:
pd.read_sql("SELECT * FROM tipo_movimiento", conn)

Empty DataFrame
Columns: [id, codigo]
Index: []

In [209]:
movimientos = [
    ('APORTE',), ('RETIRO',), ('COMPRA',), ('VENTA',)
]

In [210]:
cursor.executemany("INSERT INTO tipo_movimiento (codigo) VALUES (?)", movimientos)
conn.commit()

### Tabla `caja`

Vamos a hacerle un aporte de 10 MM CLP a la `CUENTA1` de Ricardo.

In [211]:
pd.read_sql("SELECT * FROM caja", conn).style.format({'monto': '{:,.0f}'})

In [212]:
qry = "INSERT INTO caja (id_cuenta, codigo_movimiento, monto) VALUES (3, 'APORTE', 10000000)"

In [213]:
cursor.execute(qry)
conn.commit()

### Tabla `tipos_instrumentos`

Esta es una tabla con data estática. Vamos a insertar dos tipos de instrumentos.

In [214]:
pd.read_sql("SELECT * FROM tipos_instrumentos", conn)

Empty DataFrame
Columns: [id, codigo]
Index: []

In [215]:
tipos_instrumentos = [
    ('ACCIONES',), ('CUOTA_FONDOS',), ('ETF',)
]

In [216]:
cursor.executemany("INSERT INTO tipos_instrumentos (codigo) VALUES (?)", tipos_instrumentos)
conn.commit()

### Tabla `instrumentos`

In [217]:
pd.read_sql("SELECT * FROM instrumentos", conn)

Empty DataFrame
Columns: [id, codigo, codigo_instrumento]
Index: []

In [218]:
instrumentos = [
    ('COPEC', 'ACCIONES'),
    ('MMKT_LV', 'CUOTA_FONDOS'),
    ('SP500', 'ETF'),
]

In [219]:
cursor.executemany("INSERT INTO instrumentos (codigo, codigo_instrumento) VALUES (?, ?)", instrumentos)
conn.commit()

### Compra de un Instrumento

Aquí vamos a ver un ejemplo de la utilidad de usar `commit`. Al ingresar una compra de un instrumento, se deben realizar dos inserciones de datos:

- Un nuevo registro en la tabla `inversiones`
- Un nuevo movimiento en la tabla `caja` que refleje que se ha utilizado el saldo.

Ambas operaciones están envueltas de forma explícita en una `TRANSACTION`, de modo que si cualquier parte de ésta falla, no quedará incompleta y todo se puede reversar.

In [220]:
id_cuenta = 3
instrumento = 'COPEC'
codigo = 'COMPRA'
numero = 1000
precio = 7150

In [221]:
qry_caja = "INSERT INTO caja (id_cuenta, codigo_movimiento, monto) VALUES (?, ?, ?)"

In [222]:
qry_inversion = "INSERT INTO inversiones (id_cuenta, codigo_instrumento, monto, precio) \
VALUES (?, ?, ?, ?)"

In [223]:
try:
    cursor.execute("BEGIN TRANSACTION")
    cursor.execute(qry_caja, [id_cuenta, codigo, numero * precio if codigo == 'VENTA' else -numero * precio])
    cursor.execute(qry_inversion, [id_cuenta, instrumento, numero, precio])
    conn.commit()
except Exception as e:
    print(str(e))
    cursor.execute("ROLLBACK")

In [224]:
pd.read_sql("SELECT * FROM caja", conn)

   id  id_cuenta codigo_movimiento     monto
0   1          3            APORTE  10000000
1   2          3            COMPRA  -7150000

In [225]:
pd.read_sql("SELECT * FROM inversiones", conn)

   id  id_cuenta codigo_instrumento  monto  precio
0   1          3              COPEC   1000    7150

## Cerrar Conexión

In [226]:
stop

NameError: name 'stop' is not defined

In [ ]:
conn.close()